run/SMDMP/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 474.79 -1553.6 1130.3)
    ( -380.04 -1553.6 1130.3)
    ( 474.79 -54.197 1130.3)
    ( -380.04 -54.197 1130.3)
    ( 474.79 -1553.6 0)
    ( -380.04 -1553.6 0)
    ( 474.79 -54.197 0)
    ( -380.04 -54.197 0)
);

blocks
(
    hex (5 4 6 7 1 0 2 3) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (3 2 6 7)
    )
    patch outlet
    (
        (5 4 0 1)
    )
    wall lowerWall
    (
        (5 4 6 7)
        (7 5 1 3)
		(4 6 2 0)
    )
    patch atmosphere
    (
        (1 0 2 3)
    )
);

mergePatchPairs
(
);




// ************************************************************************* //
