run/SMDMP/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          2500;
        startFace       367500;
    }
    outlet
    {
        type            patch;
        nFaces          2500;
        startFace       370000;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7500;
        startFace       372500;
    }
    atmosphere
    {
        type            patch;
        nFaces          2500;
        startFace       380000;
    }
)

// ************************************************************************* //
