run/SMDMP/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

atmosphere.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       180;
}

inlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       180;
}

outlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       180;
}

wall.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       180;
}


// ************************************************************************* //
